app/controllers/authentications_controller.rb

INSERT INTO `authentications` (`created_at`, `provider`, `uid`, `updated_at`, `user_id`) VALUES ('2015-01-20 09:57:42', 'facebook', '10153007229409663', '2015-01-20 09:57:42', 2)
INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `updated_at`) VALUES ('2015-01-20 09:57:42', 'y_ashu_rao@ymail.com', '$2a$10$QTcOACluFd2MFSuAngb0KuDZGbDAWHOYGZ1xsQPzsTncvd/yymg.q', '2015-01-20 09:57:42')
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'y_ashu_rao@ymail.com' ORDER BY `users`.`id` ASC LIMIT 1
---
	def create
	  omniauth_auth = request.env['omniauth.auth']
	  if current_user
		current_user.authentications.create(provider: omniauth_auth[:provider], uid: omniauth_auth['uid'])
		_user = current_user
	  else
	    info = omniauth_auth['info']
		email = info[:email]

	  	_user = User.where(email: email).first